#+title:  On Continued Fractions
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *continued-fractions* :tangle continued_fractions.py

#+toc: headlines 2

This chapter contains my own perspective on continued fractions. When I skimmed over the
Appendix or read [[https://en.wikipedia.org/wiki/Continued_fraction][wikipedia]] I felt that there is something missing I should understand more
deeply. Hence I decided to write down my own thoughts. In particular I think that one
should put a lot of emphasis in the [[x-repr][representation formula]] in every introduction to continued
fractions. A lot of interesting corollaries follow from it. Most importantly an nice [[x-error][error
estimate]].

* Some Code!
#+begin_src python
  from fractions import Fraction
  from numbers import Number, Integral, Rational
  from typing import Any, Literal
  import math
#+end_src

Let us first define a function to evaluate a given continued fraction expansion:

#+begin_src python
  OutputFormat = Literal["float"] | Literal["pair"] | Literal["rational"]


  def eval_cfrac(*coeffs: list[Number], out_format: OutputFormat = "float", callback=lambda *_: None) -> Any:
      """Evaluate the continued fraction given by coeffs."""
      assert len(coeffs) != 0, "At least one coefficient is required"

      p0, p1 = 0, 1
      q0, q1 = 1, 0

      for xi in coeffs:
          p0, p1 = p1, p1*xi + p0
          q0, q1 = q1, q1*xi + q0

          abort_loop = callback(p1, q1, p0, q0)
          if abort_loop:
              break

      if out_format == "float":
          return p1/q1
      elif out_format == "pair":
          return p1, q1
      elif "rational":
          return Fraction(p1, q1)
      else:
          raise Exception(f"Unknown output format '{out_format}'")
#+end_src

The next function either takes a number as input and computes its continued fraction
expansion up to a given order, or it extends a given expansion in place.

#+begin_src python
  def compute_cfrac(val_or_partial_cfrac: Number | list[Number], n: Integral, skip_remainder=False) -> list[Number]:
      """Compute the continued fraction expansion [a_0,...,a_{n-1},z_n] of the first arg.

      If the first arg is already a continued fraction expansion (with the last entry being
      a *real* number) it is modified in place. In any case the result is returned."""
      if isinstance(val_or_partial_cfrac, Number):
          return compute_cfrac([val_or_partial_cfrac], n, skip_remainder=skip_remainder)

      pfrac = val_or_partial_cfrac
      n += 1 - len(pfrac)

      for _ in range(n):
          z = pfrac.pop()
          a = math.floor(z)
          z1 = z % 1

          if z1 == 0:
              pfrac.append(a)
              break
          else:
              pfrac += [a, z1**(-1)]

      return pfrac[:-1] if (z1 != 0 and skip_remainder) else pfrac
#+end_src

Let us demonstrate these functions on $\pi$:

#+name: cfrac-pi
#+begin_src python :results output replace :cache yes :tangle no
  pi10 = compute_cfrac(math.pi, 10)
  print(f"π = {pi10}")

  print("\nConvergents of π:")
  eval_cfrac(*pi10[:-1], callback=lambda p, q, *_: \
             print(f"{str(Fraction(p,q)):20} | error = {abs(math.pi - p/q):.3E}"))
#+end_src

#+RESULTS[68c46da312b6ce5f8ce071d51979358ed595c0ee]: cfrac-pi
#+begin_example
π = [3, 7, 15, 1, 292, 1, 1, 1, 2, 1, 3.93464231529632]

Convergents of π:
3                    | error = 1.416E-01
22/7                 | error = 1.264E-03
333/106              | error = 8.322E-05
355/113              | error = 2.668E-07
103993/33102         | error = 5.779E-10
104348/33215         | error = 3.316E-10
208341/66317         | error = 1.224E-10
312689/99532         | error = 2.914E-11
833719/265381        | error = 8.715E-12
1146408/364913       | error = 1.611E-12
#+end_example

We can nicely see that at first the error decreases rapidly, but then it slows down. The
slow-down is consistent with the expansion starting with primarily large values followed by
several small values. Also note that during the slow period the denominator increases only
marginally.

Let us give a *warning*: The above implementation of =compute_cfrac= is not very reliable
/for certain inputs/. Unfortunately for "typical" /rational/ numbers it fails badly /if
they are represented as floats/. See:

#+begin_src python :results replace verbatim :cache yes :tangle no
  # Expected result: [0, 1, 2, 1, 7, 3, 1]
  compute_cfrac(0b1011_1110 / 2**8, 10)
#+end_src

#+RESULTS[51bdbc3ea96b8a80f2c40f70da4b856f064ac734]:
: [0, 1, 2, 1, 7, 3, 1, 7036874417766, 2, 2, 102.00000000000036]

We immediately see that the =7036874417766= looks a bit odd (following the little =1=). We
also see that the error accumulates quickly since =math.log2(7036874417766)==42.678...=
(which is well below $52$, the number of mantissa bits for double precision). So while
this allows us to interactively determine the continued fraction of a binary such as
=0.10111110= it makes automation very hard.

Before we solve our dilemma let us briefly mention that there is already something built
into python which behaves better:

#+begin_src python :results replace :tangle no :cache yes
  Fraction(0b1011_1110 / 2**8)
#+end_src

#+RESULTS[0b7b32bc56ae1c827ab2729baf3cfb26c4c3627f]:
: 95/128

Also it has a nice feature to limit the denominator:

#+begin_src python :results replace :tangle no :cache yes
  Fraction(0b1011_1110 / 2**8).limit_denominator(100)
#+end_src

#+RESULTS[f7b3d19647070ce272a67b12fa3b769bf95649a8]:
: 72/97

How do we solve our problem? Fortunately in case of order finding we already know the
exact /rational/ representation of our input $\varphi$ (recall that it is given in terms
of a finite binary expansion and hence rational!). Hence we can completely avoid floating
point issues by using a /rational numerical type/:

#+begin_src python :results replace verbatim :tangle no :cache yes
  compute_cfrac(Fraction(0b1011_1110, 2**8), 10)
#+end_src

#+RESULTS[4fdd9500d57a961eecc9d35f88958a0befd2eae4]:
: [0, 1, 2, 1, 7, 4]

This also works for rationals which are not exactly representable by 64bit floats.

Remark: Whenever we have a /float/ we could always read out its bit representation which
directly yields a rational representation! That is not important for order finding but it
is good to be aware of the fact that it is /pointless/ (in a sense) to apply =compute_cfrac=
to a =float=.

Finally let us define a function which will be helpful in order finding:

#+begin_src python
  def get_convergent(value: Rational, limit_denominator: Integral) -> Fraction:
      """Compute the last convergent of 'value' whose denominator is smaller than 'limit_denominator'."""
      # Second arg is just something large enough for what we want:
      cfrac = compute_cfrac(value, limit_denominator)
      result = None

      def callback(p, q, *args):
          nonlocal result
          if q <= limit_denominator:
              result = Fraction(p, q)
          else:
              return True  # no need to further run evalutation

      eval_cfrac(*cfrac, callback=callback)

      return result
#+end_src

We note here that src_python{get_convergent(value, limit)} is not the same as
src_python{Fraction(value).limit_denominator(limit)}. In fact, not every best
approximation is a convergent. Let us demonstrate this with $\pi$ (again):

#+begin_src python :results replace verbatim :cache yes :tangle no
  l = []
  for i in range(1,355):
      frac = Fraction(math.pi).limit_denominator(i)
      if not l or frac != l[-1]:
          l.append(frac)

  ", ".join([str(f) for f in l])
#+end_src

#+RESULTS[f19e2a69fe501d26b714b7a69cce35c78337a07d]:
: 3, 13/4, 16/5, 19/6, 22/7, 179/57, 201/64, 223/71, 245/78, 267/85, 289/92, 311/99, 333/106, 355/113

For example the fractions =13/4, 16/5, 19/6= are not convergents of $\pi$. Hence we
*cannot* /directly/ use =Fraction= for order finding.
